packages/dars/dars-2.1.0.tar.gz/dars-2.1.0/dars/templates/getdocsbyreestrnumberrequest.xml.j2

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://zakupki.gov.ru/fz44/get-docs-ip/ws">
{% include 'header.xml.j2' -%}
<soapenv:Body>
<ws:getDocsByReestrNumberRequest>
{% include 'index.xml.j2' %}
<selectionParams>
	<subsystemType>{{ context.subsystem_type }}</subsystemType>
	<reestrNumber>{{ context.reestr_number }}</reestrNumber>
</selectionParams>
</ws:getDocsByReestrNumberRequest>
</soapenv:Body>
</soapenv:Envelope>
