packages/dars/dars-2.1.0.tar.gz/dars-2.1.0/dars/templates/getdocsbyorgregionrequest.xml.j2

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://zakupki.gov.ru/fz44/get-docs-ip/ws">
{% include 'header.xml.j2' -%}
<soapenv:Body>
<ws:getDocsByOrgRegionRequest>
{% include 'index.xml.j2' %}
<selectionParams>
	<orgRegion>{{ context.kladr_region }}</orgRegion>
	<subsystemType>{{ context.subsystem_type }}</subsystemType>
	{% if context.base == 'fz44' -%}
	<documentType44>{{ context.document_type }}</documentType44>
	{% elif context.base == 'fz223' -%}
	<documentType223>{{  context.document_type }}</documentType223>
	{% elif context.base == 'pprf615' -%}
	<documentType44>{{  context.document_type }}</documentType44>
	{% endif -%}
	<periodInfo>
		<exactDate>{{ context.exact_date }}</exactDate>
	</periodInfo>
	{% if context.reestr_number %}<reestrNumber>{{ context.reestr_number }}</reestrNumber>{% endif %}
</selectionParams>
</ws:getDocsByOrgRegionRequest>
</soapenv:Body>
</soapenv:Envelope>
